Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E12C.tmx
Source language: en_us
Languages: zh_cn

source: How to Save a Wet Cell Phone
zh_cn: 怎样挽救落水手机

source: If you've ever dropped your iPhone in the pool, run it through the washing machine, or have it slip out of your hands and into the toilet, you know the meaning of the word "panic."
zh_cn: 如果你的手机曾掉入水池，忘记掏出口袋而被洗衣机水洗，或是不小心滑落调入马桶，你就会深深的理解“惊慌失措”这个词。

source: Screw things up and you may lose those photos of your newborn you forgot to download and your entire list of contacts. Plus you're out the price of the phone (insurance doesn't cover water damage).
zh_cn: 因此你可能会失去那些未存档的宝宝照片，全部的联系人的资料，外加手机的报废（售后保险不包括水浸造成的伤害）。

source: The key is to act fast. Here are the most popular methods of saving your cell once it's hit the drink.
zh_cn: 如果你想挽救手机就要行动迅速，下面是几种最流行的方法来挽救浸水的手机。

source: It's a truth universally acknowledged that your first step should be to remove the battery. Immediately.
zh_cn: 人尽皆知的第一步是马上移除电池。

source: "I know it's tempting, but resist the urge to power up your phone to see if it works-just turning it on can short out the circuits," writes Joel Johnson of PopularMechanics.com.
zh_cn: "人们都想马上开机检查一下手机是否能用，但是一旦开机，手机的电路板就会短路烧坏。"乔尔约翰逊在时尚电子网站（PopularMechanics.com）上写道。

source: Take out the SIM card, too, which may retain data like contacts even if the phone itself is fried.
zh_cn: 取出电话卡，确保即使手机烧坏了，电话卡上保存的联系人的数据依然完好。

source: Your goal is then to try to speed up the drying process without damaging the phone further--if the phone stays wet for too long it will start to corrode.
zh_cn: 在不进一步损害你的手机的前提下，快速干燥你的手机。如果手机在潮湿的状态下保持时间过长，水分就会侵蚀手机的部件。

source: Skip the hairdryer, as it's too hot for this purpose.
zh_cn: 不要用吹风机，对于手机来说其产生的温度过高。

source: A better choice is a can of compressed air, an air compressor set to a low psi or a wet/dry Shop Vac.
zh_cn: 一个较好的选择是一个压缩空气罐，设定为较低的气压或是抽湿。

source: The next step--or the first, if you don't have a compressed air source--is to wick any remaining moisture by submerging the phone in a bowl or bag of uncooked white rice and/or silicants if you have them handy. (That's granular stuff that comes in those tiny packets at the bottom of aspirin bottles, beef jerky, the pockets of new clothing--raid your home to find as much as you can).
zh_cn: 下一步是——如果您没有压缩空气的话，这将是第一步，将手机埋入生米中或是干燥剂中以去除残留的水分（干燥剂可以从阿司匹林药瓶、牛肉干或是新衣服的包装袋中找到，尽力迅速找到足够多）。

source: Here are the details on how to do it according to eHow.com.
zh_cn: 这里是关于操作的具体细节，请参考网站 eHow.com。

source: OK, you've ransacked the house for rice and a can of compressed air to no avail. Don't despair.
zh_cn: 如果你在家中找不到大米或是空气压缩机，不要绝望。

source: You may be able freeze the phone to fix it, as you'll discover at Instructables.com.
zh_cn: 你或许可以通过冰冻的方式来修复手机，这种方法可以在网站Instructables.com上找到。

source: Again, make sure the battery is removed before placing the phone on two to three layers of paper towel (to prevent frost damage).
zh_cn: 再一次强调一定要取出电池，然后将手机放置于2到3张纸巾上，以预防冰冻造成的伤害。

source: Then put it in the freezer for about 15-20 minutes. Replace the battery and power up to see if the phone works.
zh_cn: 将其在冰箱中放置大约15-20分钟后，取出，装回电池，重启，看一下是否正常。

source: If not, remove the battery, stick it back in the freezer for another 5 to 10 minutes and check again.
zh_cn: 如果不能正常工作，取出电池并放回冰箱5-10分钟。

source: Chances are you'll have a working phone after a couple of tries.
zh_cn: 在经过几次尝试后，你或许能修好它。

source: Finally, there are bags known as Bheesties ? that are specifically designed to dry out wet cell phones and other small personal electronics devices, available at Bheestie.com for $20 each plus shipping and handling.
zh_cn: 最后，在网站Bheestiecom有售一种专门为干燥落水手机或其他电子设备而设计的袋子，名叫Bheesties，其价格（包含包装和运费在内）为每件20美元。

source: The problem is that time is of the essence, so if you have an expensive phone and know you're a butterfingers, order one ahead of time and have on hand in case of emergency.
zh_cn: 但是有一个问题，时间是至关重要的。所以如果你有一个十分贵重的手机，而自己又是一个笨手笨脚的人，提前预定一个以防万一。
